
## ðŸ¥ Medical Insurance Cost Analysis (Part I)

This project explores a dataset containing information about individuals and their corresponding **medical insurance charges**. The aim is to **analyze the factors affecting insurance costs**, such as age, BMI, smoking habits, and region, and uncover patterns that can inform healthcare insights and cost predictions.

### ðŸ“Š Dataset Overview

The dataset includes **1,338 observations** with the following features:

| Feature    | Description                                |
| ---------- | ------------------------------------------ |
| `age`      | Age of the individual (in years)           |
| `sex`      | Gender of the individual (`male`/`female`) |
| `bmi`      | Body Mass Index                            |
| `children` | Number of children/dependents              |
| `smoker`   | Smoking status (`yes`/`no`)                |
| `region`   | Residential region in the US               |
| `charges`  | Individual medical insurance charges (USD) |

---

### ðŸŽ¯ Objectives

* Perform **exploratory data analysis (EDA)** to understand the distribution and relationships between variables.
* Investigate how features such as **BMI, smoking, and region** affect medical insurance charges.

> In the Part II of the work, the focus will be on:
* Visualize patterns and trends using graphs and summaries.
* Prepare the data for potential **predictive modeling** (optional extension).

In [ ]:
import pandas as pd
insurance_df = pd.read_csv(r"C:\Users\Ogunl\Desktop\Data Science\Dataset\Portfolio dataset\python-portfolio-project-starter-files\insurance.csv")
insurance_df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [ ]:
#Set the sex,region,smoker column into title case and put the charges column into 2 decimal places
insurance_df['sex'] = insurance_df['sex'].str.title()
insurance_df['region'] = insurance_df['region'].str.title()
insurance_df['smoker'] = insurance_df['smoker'].str.title()
insurance_df['charges'] = round(insurance_df['charges'], 2)

In [ ]:
insurance_df.head(2)

   age     sex    bmi  children smoker     region   charges
0   19  Female  27.90         0    Yes  Southwest  16884.92
1   18    Male  33.77         1     No  Southeast   1725.55

In [ ]:
total_population = len(insurance_df)
total_population

1338

In [ ]:
insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [ ]:
insurance_df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422280
std      14.049960     6.098187     1.205493  12110.011259
min      18.000000    15.960000     0.000000   1121.870000
25%      27.000000    26.296250     0.000000   4740.287500
50%      39.000000    30.400000     1.000000   9382.030000
75%      51.000000    34.693750     2.000000  16639.915000
max      64.000000    53.130000     5.000000  63770.430000

#possible insight from this dataset:
1. Does birth has anything to do with region. Which region has the highest number of children?
2. What is the earlier age for child birth
3. Is there any relationship between age and bmi
4. Effect of smoking on bmi
5. Effect of smoking on insurance cost
6. Does sex affect the insurance cost

In [ ]:
insurance_df['sex'].value_counts()

sex
Male      676
Female    662
Name: count, dtype: int64

In [ ]:
#highest charges
print(f'The highest charges on insurance is {round(insurance_df['charges'].max(), 2)}')
#lowest charges
print(f'The lowest charges on insurance is {round(insurance_df['charges'].min(), 2)}')

The highest charges on insurance is 63770.43
The lowest charges on insurance is 1121.87

In [ ]:
def sex_score(column):
    if column['sex'] == 'male':
        output = 1
    else:
        output = 0
    return output

In [ ]:
insurance_df['sex_coded'] = insurance_df.apply(sex_score, axis=1)

# Show renewed customers
insurance_df.head()

   age     sex     bmi  children smoker     region   charges  sex_coded
0   19  Female  27.900         0    Yes  Southwest  16884.92          0
1   18    Male  33.770         1     No  Southeast   1725.55          0
2   28    Male  33.000         3     No  Southeast   4449.46          0
3   33    Male  22.705         0     No  Northwest  21984.47          0
4   32    Male  28.880         0     No  Northwest   3866.86          0

In [ ]:
#I can also easily map them
# Map categorical variables to numeric
#insurance_df['sex_num'] = insurance_df['sex'].map({'female': 0, 'male': 1})
insurance_df['smoker_num'] = insurance_df['smoker'].map({'No': 0, 'Yes': 1})

insurance_df.head()

,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
0,19,Female,27.900,0,Yes,Southwest,16884.92,0,1
1,18,Male,33.770,1,No,Southeast,1725.55,0,0
2,28,Male,33.000,3,No,Southeast,4449.46,0,0
3,33,Male,22.705,0,No,Northwest,21984.47,0,0
4,32,Male,28.880,0,No,Northwest,3866.86,0,0

In [ ]:
#Region overview
insurance_df['region'].unique()

array(['Southwest', 'Southeast', 'Northwest', 'Northeast'], dtype=object)

In [ ]:
insurance_df['region'].value_counts()

region
Southeast    364
Southwest    325
Northwest    325
Northeast    324
Name: count, dtype: int64

In [ ]:
#birth by region
birth_by_region = insurance_df.groupby('region')['children'].count()
birth_by_region

region
Northeast    324
Northwest    325
Southeast    364
Southwest    325
Name: children, dtype: int64

### Region with the highest age_mean

In [ ]:
region_with_highest_mean = birth_by_region_.loc[birth_by_region_['age_mean'].idxmax()]
region_with_highest_mean

region      Southwest
age_mean    39.455385
Name: 3, dtype: object

In [ ]:
region_name = birth_by_region_.loc[birth_by_region_['age_mean'].idxmax(), 'region']
print(f'{region_name} has the highest number of age')

Southwest has the highest number of age

### Smokers distribution by sex:

In [ ]:
insurance_df['smoker'].value_counts()

smoker
No     1064
Yes     274
Name: count, dtype: int64

In [ ]:
#male_smokers
male_smokers = insurance_df[(insurance_df['sex'] == 'Male') & (insurance_df['smoker'] == 'Yes')]
male_smokers.head()

,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
14,27,Male,42.13,0,Yes,Southeast,39611.76,0,1
19,30,Male,35.30,0,Yes,Southwest,36837.47,0,1
29,31,Male,36.30,2,Yes,Southwest,38711.00,0,1
30,22,Male,35.60,0,Yes,Southwest,35585.58,0,1
34,28,Male,36.40,1,Yes,Southwest,51194.56,0,1

In [ ]:
#Male nonsmokers
male_nonsmokers = insurance_df[(insurance_df['sex'] == 'Male') & (insurance_df['smoker'] == 'No')]
male_nonsmokers.head()

,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
1,18,Male,33.770,1,No,Southeast,1725.55,0,0
2,28,Male,33.000,3,No,Southeast,4449.46,0,0
3,33,Male,22.705,0,No,Northwest,21984.47,0,0
4,32,Male,28.880,0,No,Northwest,3866.86,0,0
8,37,Male,29.830,2,No,Northeast,6406.41,0,0

In [ ]:
#total_male_smokers
total_male_smokers = ((insurance_df['sex'] == 'Male') & (insurance_df['smoker'] == 'Yes')).sum()
total_male_smokers

159

In [ ]:
#total_male_nonsmokers
total_male_nonsmokers = ((insurance_df['sex'] == 'Male') & (insurance_df['smoker'] == 'No')).sum()
total_male_nonsmokers

517

In [ ]:
#female smokers
female_smokers = insurance_df[(insurance_df['sex'] == 'Female') & (insurance_df['smoker'] == 'Yes')]
female_smokers.head()

,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
0,19,Female,27.90,0,Yes,Southwest,16884.92,0,1
11,62,Female,26.29,0,Yes,Southeast,27808.73,0,1
23,34,Female,31.92,1,Yes,Northeast,37701.88,0,1
58,53,Female,22.88,1,Yes,Southeast,23244.79,0,1
64,20,Female,22.42,0,Yes,Northwest,14711.74,0,1

In [ ]:
#female nonsmokers
female_nonsmokers = insurance_df[(insurance_df['sex'] == 'Female') & (insurance_df['smoker'] == 'No')]
female_nonsmokers.head()

,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
5,31,Female,25.74,0,No,Southeast,3756.62,0,0
6,46,Female,33.44,1,No,Southeast,8240.59,0,0
7,37,Female,27.74,3,No,Northwest,7281.51,0,0
9,60,Female,25.84,0,No,Northwest,28923.14,0,0
13,56,Female,39.82,0,No,Southeast,11090.72,0,0

In [ ]:
#total female smokers
total_female_smokers = ((insurance_df['sex'] == 'Female') & (insurance_df['smoker'] == 'Yes')).sum()
total_female_smokers

115

In [ ]:
#total female nonsmokers
total_female_nonsmokers = ((insurance_df['sex'] == 'Female') & (insurance_df['smoker'] == 'No')).sum()
total_female_nonsmokers

547

In [ ]:
#aggregate the distribution
smokers_by_sex = insurance_df.groupby(['sex', 'smoker']).agg({'smoker_num': 'count'})
smokers_by_sex.columns = ['no_of_smokers']
smokers_by_sex= smokers_by_sex.reset_index()
smokers_by_sex

      sex smoker  no_of_smokers
0  Female     No            547
1  Female    Yes            115
2    Male     No            517
3    Male    Yes            159

### Smokers distribution by their sex and bmi:

In [ ]:
#Smoker by their sex and bmi
smokers_by_sex_bmi = insurance_df.groupby(['sex', 'smoker']).agg({'smoker': 'count', 'bmi': ['mean', 'median']})
smokers_by_sex_bmi.columns = ['no_of_smokers', 'bmi_mean', 'bmi_median']
smokers_by_sex_bmi

               no_of_smokers   bmi_mean  bmi_median
sex    smoker
Female No                547  30.539525      30.210
       Yes               115  29.608261      28.380
Male   No                517  30.770580      30.495
       Yes               159  31.504182      31.130

In [ ]:
total_smokers = (insurance_df['smoker'] == 'Yes').sum()
total_smokers

274

In [ ]:
print(f"The result shows that out of {total_population} population, \nThere are a total {total_smokers} smokers.")
print(f"{total_female_nonsmokers} of the smokers are female while {total_male_smokers} are male")
print('The mean and median values of the bmi have similar pattern in the same sex. They are however higher in female non_smokers and lower in make smokers')

The result shows that out of 1338 population,
There are a total 274 smokers.
547 of the smokers are female while 159 are male
The mean and median values of the bmi have similar pattern in the same sex. They are however higher in female non_smokers and lower in make smokers

#### Bmi distribution by sex:

In [ ]:
bmi_to_sex = insurance_df.groupby(['sex']).agg({'bmi': ['mean', 'median']})
bmi_to_sex.columns = ['bmi_mean', 'bmi_median']
bmi_to_sex = bmi_to_sex.reset_index()
bmi_to_sex

      sex   bmi_mean  bmi_median
0  Female  30.377749     30.1075
1    Male  30.943129     30.6875

##### The output shows that male bmi in the dataset is slightly higher than female wether they are smokers or not.

## Does sex affect bmi? Is there a correlation between childbearing and the bmi?

In [ ]:
#take a quick glance at the columns again:
insurance_df['children'].unique()

array([0, 1, 3, 2, 5, 4], dtype=int64)

##### There are 5 unique values in the column children. This indicates that there are individuals in the population have children ranging from 1-5

In [ ]:
insurance_df['children'].value_counts()

children
0    574
1    324
2    240
3    157
4     25
5     18
Name: count, dtype: int64

In [ ]:
no_child = (insurance_df['children'] == 0).sum()
one_child = (insurance_df['children'] == 1).sum()
two_children = (insurance_df['children'] == 2).sum()
three_children = (insurance_df['children'] == 3).sum()
four_children = (insurance_df['children'] == 4).sum()
five_children = (insurance_df['children'] == 5).sum()

In [ ]:
childbearing_range = no_child, one_child, two_children, three_children, four_children, five_children
childbearing_range

(574, 324, 240, 157, 25, 18)

In [ ]:
childbearing_by_sex = insurance_df.groupby(['sex','children']).agg({'children': 'count'})
childbearing_by_sex.columns = ['No_of_children']
childbearing_by_sex

                 No_of_children
sex    children
Female 0                    289
       1                    158
       2                    119
       3                     77
       4                     11
       5                      8
Male   0                    285
       1                    166
       2                    121
       3                     80
       4                     14
       5                     10

In [ ]:
childbearing_by_sex = childbearing_by_sex.reset_index()
childbearing_by_sex

       sex  children  No_of_children
0   Female         0             289
1   Female         1             158
2   Female         2             119
3   Female         3              77
4   Female         4              11
5   Female         5               8
6     Male         0             285
7     Male         1             166
8     Male         2             121
9     Male         3              80
10    Male         4              14
11    Male         5              10

The above table is essential as it shows us the number of children by sex.
Each row represents an individual. The table shows childbearing distribution across gender.

In [ ]:
#Find the total enteries for children under female
childbearing_by_sex_agg = childbearing_by_sex.groupby('sex').agg({'No_of_children':'sum'})
childbearing_by_sex_agg

        No_of_children
sex
Female             662
Male               676

##### These values however includes the values of those without children. Thus, we need to know the number of those with children ONLY, in order to know the actual of childbearing distribution across the sex

In [ ]:
#to know the actual number of childbearing by sex
childbearing_by_sex = childbearing_by_sex[childbearing_by_sex['children'] != 0]
childbearing_by_sex

C:\Users\Ogunl\anaconda3\Lib\site-packages\IPython\core\displayhook.py:281: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

       sex  children  No_of_children
1   Female         1             158
2   Female         2             119
3   Female         3              77
4   Female         4              11
5   Female         5               8
7     Male         1             166
8     Male         2             121
9     Male         3              80
10    Male         4              14
11    Male         5              10

In [ ]:
actual_childbearing_by_sex = childbearing_by_sex.groupby('sex').agg({'No_of_children':'sum'})
actual_childbearing_by_sex = actual_childbearing_by_sex.reset_index()
actual_childbearing_by_sex

      sex  No_of_children
0  Female             373
1    Male             391

In [ ]:
insurance_df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges',
       'sex_coded', 'smoker_num'],
      dtype='object')

In [ ]:
bmi_by_sex_children = insurance_df.groupby(['sex', 'children']).agg({'bmi':['mean', 'median']})
bmi_by_sex_children.columns = ['bmi_mean', 'bmi_median']
bmi_by_sex_children

                  bmi_mean  bmi_median
sex    children
Female 0         30.361522     29.9250
       1         30.052658     29.5675
       2         30.649790     31.3000
       3         30.436429     30.2100
       4         31.943182     29.6400
       5         30.620625     30.2500
Male   0         30.741719     30.5900
       1         31.166145     30.3500
       2         31.300992     31.7300
       3         30.922937     30.7900
       4         30.957500     30.2375
       5         28.792500     27.1500

In [ ]:
bmi_by_sex_children = bmi_by_sex_children.reset_index()
bmi_by_sex_children

       sex  children   bmi_mean  bmi_median
0   Female         0  30.361522     29.9250
1   Female         1  30.052658     29.5675
2   Female         2  30.649790     31.3000
3   Female         3  30.436429     30.2100
4   Female         4  31.943182     29.6400
5   Female         5  30.620625     30.2500
6     Male         0  30.741719     30.5900
7     Male         1  31.166145     30.3500
8     Male         2  31.300992     31.7300
9     Male         3  30.922937     30.7900
10    Male         4  30.957500     30.2375
11    Male         5  28.792500     27.1500

##### The output shows no pattern regarding the effect of childbearing on the bmi

## Examining REGION

In [ ]:
#region by smoking
region_smoking_ = insurance_df.groupby(['region', 'smoker']).agg({'smoker':'count'})
region_smoking_

                  smoker
region    smoker
Northeast No         257
          Yes         67
Northwest No         267
          Yes         58
Southeast No         273
          Yes         91
Southwest No         267
          Yes         58

In [ ]:
#region by smoking
region_smoking = insurance_df.groupby(['region', 'smoker']).agg({'smoker':'count'})
region_smoking.columns = ['smoking_count']
region_smoking = region_smoking.reset_index()
region_smoking

      region smoker  smoking_count
0  Northeast     No            257
1  Northeast    Yes             67
2  Northwest     No            267
3  Northwest    Yes             58
4  Southeast     No            273
5  Southeast    Yes             91
6  Southwest     No            267
7  Southwest    Yes             58

In [ ]:
actual_smokers_by_region = region_smoking[region_smoking['smoker'] == 'Yes']
actual_smokers_by_region

      region smoker  smoking_count
1  Northeast    Yes             67
3  Northwest    Yes             58
5  Southeast    Yes             91
7  Southwest    Yes             58

In [ ]:
actual_nonsmokers_by_region = region_smoking[region_smoking['smoker'] == 'No']
actual_nonsmokers_by_region

      region smoker  smoking_count
0  Northeast     No            257
2  Northwest     No            267
4  Southeast     No            273
6  Southwest     No            267

### Region, smoking, childbearing and how they relate with bmi

In [ ]:
region_smoker_children = insurance_df.groupby(['region','smoker', 'children']).agg({'children':'count', 'bmi':['mean', 'median']})
region_smoker_children.columns = ['number_children','bmi_mean', 'bmi_median']
region_smoker_children

                           number_children   bmi_mean  bmi_median
region    smoker children
Northeast No     0                     121  29.519876      28.785
                 1                      55  29.878364      30.590
                 2                      42  28.685476      27.740
                 3                      29  27.694138      27.360
                 4                       7  32.422143      31.350
                 5                       3  29.418333      29.640
          Yes    0                      26  27.491538      28.120
                 1                      22  30.728182      31.635
                 2                       9  23.950556      20.045
                 3                      10  30.751500      30.305
Northwest No     0                     108  28.820185      28.975
                 1                      65  28.858077      28.310
                 2                      55  29.676273      30.590
                 3                      33  30.420152      30.210
                 4                       5  30.229000      27.930
                 5                       1  24.225000      24.225
          Yes    0                      24  29.422292      28.690
                 1                       9  27.265000      27.835
                 2                      11  28.491364      25.840
                 3                      13  30.546154      30.875
                 4                       1  28.120000      28.120
Southeast No     0                     117  33.701368      33.880
                 1                      73  33.298356      32.230
                 2                      48  33.465208      33.550
                 3                      24  32.926667      33.055
                 4                       5  34.232000      33.660
                 5                       6  31.368333      29.480
          Yes    0                      40  33.222750      33.495
                 1                      22  32.265000      30.965
                 2                      18  34.570556      35.585
                 3                      11  31.890000      31.020
Southwest No     0                     113  30.051327      29.800
                 1                      70  29.838571      29.950
                 2                      40  31.742500      31.250
                 3                      32  32.184375      31.500
                 4                       5  29.520000      29.400
                 5                       7  30.557143      28.600
          Yes    0                      25  30.508000      30.900
                 1                       8  31.512500      31.050
                 2                      17  33.558824      34.200
                 3                       5  26.980000      25.900
                 4                       2  29.900000      29.900
                 5                       1  18.300000      18.300

In [ ]:
region_smoker_children = insurance_df.groupby(['region','smoker', 'children']).agg({'children':'count', 'bmi':['mean', 'median']})
region_smoker_children.columns = ['number_children','bmi_mean', 'bmi_median']
region_smoker_children = region_smoker_children.reset_index()
region_smoker_children

       region smoker  children  number_children   bmi_mean  bmi_median
0   Northeast     No         0              121  29.519876      28.785
1   Northeast     No         1               55  29.878364      30.590
2   Northeast     No         2               42  28.685476      27.740
3   Northeast     No         3               29  27.694138      27.360
4   Northeast     No         4                7  32.422143      31.350
5   Northeast     No         5                3  29.418333      29.640
6   Northeast    Yes         0               26  27.491538      28.120
7   Northeast    Yes         1               22  30.728182      31.635
8   Northeast    Yes         2                9  23.950556      20.045
9   Northeast    Yes         3               10  30.751500      30.305
10  Northwest     No         0              108  28.820185      28.975
11  Northwest     No         1               65  28.858077      28.310
12  Northwest     No         2               55  29.676273      30.590
13  Northwest     No         3               33  30.420152      30.210
14  Northwest     No         4                5  30.229000      27.930
15  Northwest     No         5                1  24.225000      24.225
16  Northwest    Yes         0               24  29.422292      28.690
17  Northwest    Yes         1                9  27.265000      27.835
18  Northwest    Yes         2               11  28.491364      25.840
19  Northwest    Yes         3               13  30.546154      30.875
20  Northwest    Yes         4                1  28.120000      28.120
21  Southeast     No         0              117  33.701368      33.880
22  Southeast     No         1               73  33.298356      32.230
23  Southeast     No         2               48  33.465208      33.550
24  Southeast     No         3               24  32.926667      33.055
25  Southeast     No         4                5  34.232000      33.660
26  Southeast     No         5                6  31.368333      29.480
27  Southeast    Yes         0               40  33.222750      33.495
28  Southeast    Yes         1               22  32.265000      30.965
29  Southeast    Yes         2               18  34.570556      35.585
30  Southeast    Yes         3               11  31.890000      31.020
31  Southwest     No         0              113  30.051327      29.800
32  Southwest     No         1               70  29.838571      29.950
33  Southwest     No         2               40  31.742500      31.250
34  Southwest     No         3               32  32.184375      31.500
35  Southwest     No         4                5  29.520000      29.400
36  Southwest     No         5                7  30.557143      28.600
37  Southwest    Yes         0               25  30.508000      30.900
38  Southwest    Yes         1                8  31.512500      31.050
39  Southwest    Yes         2               17  33.558824      34.200
40  Southwest    Yes         3                5  26.980000      25.900
41  Southwest    Yes         4                2  29.900000      29.900
42  Southwest    Yes         5                1  18.300000      18.300

The result shows that smokers generally have lower number of children compare to nonsmokers across all region.
In fact, expect in the Southwest region where 1 smoker has 5 children, no other smoker has 5 children across the regions.
However, in all region, nonsmokers have 5 children.

Importantly, the bmi values also do not follow a regular pattern across all region

## Exploring Charges

In [ ]:
insurance_df['charges'].value_counts()

charges
1639.56     2
16884.92    1
29330.98    1
2221.56     1
19798.05    1
           ..
7345.08     1
26109.33    1
28287.90    1
1149.40     1
29141.36    1
Name: count, Length: 1337, dtype: int64

In [ ]:
#sort table by charges
sorted_table = insurance_df['charges'].sort_values()
sorted_table

940      1121.87
808      1131.51
1244     1135.94
663      1136.40
22       1137.01
          ...
819     55135.40
577     58571.07
1230    60021.40
1300    62592.87
543     63770.43
Name: charges, Length: 1338, dtype: float64

In [ ]:
sorted_table = insurance_df.sort_values(by='charges', ascending = False)
sorted_table = sorted_table.reset_index()
sorted_table

,index,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
0,543,54,Female,47.410,0,Yes,Southeast,63770.43,0,1
1,1300,45,Male,30.360,0,Yes,Southeast,62592.87,0,1
2,1230,52,Male,34.485,3,Yes,Northwest,60021.40,0,1
3,577,31,Female,38.095,1,Yes,Northeast,58571.07,0,1
4,819,33,Female,35.530,0,Yes,Northwest,55135.40,0,1
...,...,...,...,...,...,...,...,...,...,...
1333,22,18,Male,34.100,0,No,Southeast,1137.01,0,0
1334,663,18,Male,33.660,0,No,Southeast,1136.40,0,0
1335,1244,18,Male,33.330,0,No,Southeast,1135.94,0,0
1336,808,18,Male,30.140,0,No,Southeast,1131.51,0,0
1337,940,18,Male,23.210,0,No,Southeast,1121.87,0,0

In [ ]:
#do we have a nonsmoker in the 1st hundred
first_100 = sorted_table.head(150)
first_100[first_100['smoker'] == 'No']

,index,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
114,1206,59,Female,34.800,2,No,Southwest,36910.61,0,0
117,1012,61,Female,33.330,4,No,Southeast,36580.28,0,0
130,242,55,Female,26.800,1,No,Southwest,35160.13,0,0
149,599,52,Female,37.525,2,No,Northwest,33471.97,0,0

The first hundred in the most expensive insurance charges are made of smokers. In fact, when the table was sorted according to most expensive charges,
it shows that the most expensive is a smoker, without any children. In fact, the first hundred and thirteen on the list are smokers.

This indicates that smoking leads to increment in insurance charges.

In [ ]:
#does number of children affect charges
sorted_table[sorted_table['children'] == 0].head()

,index,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
0,543,54,Female,47.41,0,Yes,Southeast,63770.43,0,1
1,1300,45,Male,30.36,0,Yes,Southeast,62592.87,0,1
4,819,33,Female,35.53,0,Yes,Northwest,55135.40,0,1
5,1146,60,Male,32.80,0,Yes,Southwest,52590.83,0,1
9,488,44,Female,38.06,0,Yes,Southeast,48885.14,0,1

In [ ]:
sorted_table[sorted_table['children'] == 5].head()

,index,age,sex,bmi,children,smoker,region,charges,sex_coded,smoker_num
293,1085,39,Female,18.30,5,Yes,Southwest,19023.26,0,1
364,1272,43,Male,25.52,5,No,Southeast,14478.33,0,0
459,438,52,Female,46.75,5,No,Southeast,12592.53,0,0
524,568,49,Female,31.90,5,No,Southwest,11552.90,0,0
621,932,46,Male,25.80,5,No,Southwest,10096.97,0,0

In [ ]:
children_charges = insurance_df.groupby('sex').agg({'charges':'mean'}).reset_index()
children_charges

      sex       charges
0  Female  12569.578716
1    Male  13956.751331

Male pay more on insurance than female

In [ ]:
#charges by region
region_charges = insurance_df.groupby('region').agg({'charges':'mean'}).reset_index()
region_charges

      region       charges
0  Northeast  13406.384599
1  Northwest  12417.575169
2  Southeast  14735.411484
3  Southwest  12346.937508

In [ ]:
#charges by smokers
smoker_charges = insurance_df.groupby('smoker').agg({'charges':'mean'}).reset_index()
smoker_charges

  smoker       charges
0     No   8434.268299
1    Yes  32050.231898

In [ ]:
#charges by smokers/sex
ss_charges = insurance_df.groupby(['sex', 'smoker']).agg({'charges':'mean'}).reset_index()
ss_charges

      sex smoker       charges
0  Female     No   8762.297185
1  Female    Yes  30678.996087
2    Male     No   8087.204855
3    Male    Yes  33042.006226

In [ ]:
#charges by smokers/sex/region
ssr_charges = insurance_df.groupby(['sex', 'smoker', 'region']).agg({'charges':'mean'})
ssr_charges

                              charges
sex    smoker region
Female No     Northeast   9640.426894
              Northwest   8786.998519
              Southeast   8440.205324
              Southwest   8234.091277
       Yes    Northeast  28032.045517
              Northwest  29670.824828
              Southeast  33034.821111
              Southwest  31687.988095
Male   No     Northeast   8664.042640
              Northwest   8320.689167
              Southeast   7609.003731
              Southwest   7778.905635
       Yes    Northeast  30926.252895
              Northwest  30713.180690
              Southeast  36029.839636
              Southwest  32598.863784

In [ ]:
#charges by sex
sex_charges = insurance_df.groupby('sex').agg({'charges': ['mean', 'median']})
sex_charges

             charges
                mean    median
sex
Female  12569.578716  9412.960
Male    13956.751331  9369.615

In [ ]:
#charges by bmi
bmi_charges = insurance_df.groupby('bmi').agg({'charges': ['mean', 'median']})
bmi_charges

             charges
                mean    median
bmi
15.960   1694.800000   1694.80
16.815   4904.000000   4904.00
17.195  14455.640000  14455.64
17.290   7813.356667   6877.98
17.385   2775.190000   2775.19
...              ...       ...
48.070   9432.930000   9432.93
49.060  11381.330000  11381.33
50.380   2438.060000   2438.06
52.580  44501.400000  44501.40
53.130   1163.460000   1163.46

[548 rows x 2 columns]

##### Smoking seems to be the ultimate decided in the insurance charges. Female smokers pay more in insurance than their nonsmoker counterpart.
##### This is the same with male.
##### Last, what determine the charges across the region is either smoking on not. Thus, in predicting the charges for insurance, smoking is a critical factor